Modules/DeliveryService/Repositories/BagsRepository.php

insert into `bags` (`partner_id`, `qr_code`, `bag_number`, `bag_size`, `bag_type`, `status`, `weight`, `dimensions`, `id`, `updated_at`, `created_at`) values ('c62ff15e-262b-11ee-be56-0242ac120002', '', '', '', '', 'Available', '', '', '99aefe91-5e71-4155-9e00-650f5085b678', '2023-07-19 12:12:22', '2023-07-19 12:12:22')
---
    public function addNewBag($partner_id,$qrCode, $bagNumber, $bagSize, $bagType, $weight, $dimensions, $status = "Available")
    {
        $bag = new Bags([
            "partner_id"=>$partner_id,
            "qr_code" => $qrCode,
            "bag_number" => $bagNumber,
            "bag_size" => $bagSize,
            "bag_type" => $bagType,
            "status" => $status,
            "weight" => $weight,
            "dimensions" => $dimensions,
        ]);

        $bag->save();

update `bags` set `partner_id` = '', `bag_number` = '', `bag_size` = '', `bag_type` = '', `status` = '', `weight` = '', `dimensions` = '', `bags`.`updated_at` = '2023-07-19 12:12:23' where (`id` = '99aefe91-5e71-4155-9e00-650f5085b678')
---
    public function updateBag($id, $partner_id,$qrCode, $bagNumber, $bagSize, $bagType, $status, $weight, $dimensions)
    {
        return Bags::where(["id" => $id])->update([
            "partner_id"=>$partner_id,
            "bag_number" => $bagNumber,
            "bag_size" => $bagSize,
            "bag_type" => $bagType,
            "status" => $status,
            "weight" => $weight,
            "dimensions" => $dimensions,
        ]);