Modules/DeliveryService/Repositories/DeliveryRepository.php

    public function create($data)
    {
        return Delivery::create($data);
---
insert into `deliveries` (`status`, `is_recurring`, `payment_status`, `is_sign_required`, `is_notification_enabled`, `note`, `branch_id`, `delivery_slot_id`, `delivery_type_id`, `customer_id`, `customer_address_id`, `id`, `updated_at`, `created_at`) values ('UNASSIGN', 0, 0, 0, 1, 'Please leave the food outside the door. Do not ring doorbell and only miss call, please and thank you', '9a2d9ca3-ce8c-4a06-9007-433ec22b9cdc', '99cf0495-1359-40a0-8691-5e04a8b215a1', '', '9a2d9cfb-161a-4ff5-8a80-7d410115a74e', '9a2d9cfb-2c7a-452c-8a8a-2ea5960ccd73', '9a2d9cfb-2e3c-4253-a50a-81a289d0b9c0', '2023-09-20 10:49:39', '2023-09-20 10:49:39')