Modules/BusinessService/Repositories/BranchCoverageRepository.php

insert into `branch_coverages` (`active_status`, `area_id`, `city_id`, `state_id`, `country_id`, `branch_id`, `id`, `updated_at`, `created_at`) values (1, '9a2d7e6b-71ec-4337-a91a-84288e88849a', '32', '3391', '231', '9a2d9ca3-ce8c-4a06-9007-433ec22b9cdc', '9a2d9ca3-f02f-4122-9cf5-10f6e91592b6', '2023-09-20 10:48:41', '2023-09-20 10:48:41')
---
    public function createBranchCoverage(
        $active_status,
        $city_id,
        $state,
        $country,
        $branch_id,
        $area_id = null,
    ) {
        $branch_coverage =  BranchCoverage::create([
            "active_status" => $active_status,
            "area_id" => $area_id,
            "city_id" => $city_id,
            "state_id" => $state,
            "country_id" => $country,
            "branch_id" => $branch_id,
        ]);