Modules/BusinessService/Repositories/BranchRepository.php

insert into `branches` (`name`, `phone`, `address`, `country_id`, `state_id`, `city_id`, `area_id`, `active_status`, `is_main_branch`, `business_id`, `id`, `updated_at`, `created_at`) values ('Main Branch', '03040885424', 'asdfsaf', '231', '3391', '32', '9a2d7e6b-71ec-4337-a91a-84288e88849a', 1, 1, '9a2d9ca3-a59b-4af3-ad10-a897943b7758', '9a2d9ca3-ce8c-4a06-9007-433ec22b9cdc', '2023-09-20 10:48:41', '2023-09-20 10:48:41')
---
    public function createBranch(
        $name,
        $phone,
        $address,
        $business_id,
        $country_id = null,
        $state_id = null,
        $city_id = null,
        $area_id = null,
        $active_status = null,
        $is_main_branch = null,
        $latitude = null,
        $longitude = null
    ) {
        $branch = Branch::create([
            "name" => $name,
            "phone" => $phone,
            "address" => $address,
            "country_id" => $country_id,
            "state_id" => $state_id,
            "city_id" => $city_id,
            "area_id" => $area_id,
            "active_status" => $active_status,
            "is_main_branch" => $is_main_branch,
            "business_id" => $business_id,
        ]);