Modules/BusinessService/Repositories/BusinessUserRepository.php

insert into `business_users` (`user_id`, `business_id`, `id`, `updated_at`, `created_at`) values ('9a2d9ca3-9d2e-4425-bfec-2f5bdd9c00b8', '9a2d9ca3-a59b-4af3-ad10-a897943b7758', '9a2d9ca3-caff-4b77-af5e-08cef6df693d', '2023-09-20 10:48:41', '2023-09-20 10:48:41')
---
    public function createBusinessUser($user_id, $business_id)
    {
        $business_user = new BusinessUser([
            "user_id" => $user_id,
            "business_id" => $business_id,
        ]);
        $business_user->save();