Modules/BusinessService/Repositories/BusinessCategoryRepository.php

    public function getBusinessCategory()
    {
        return BusinessCategory::all();
---
select * from `business_categories`