Modules/BusinessService/Repositories/BusinessRepository.php

    public function get()
    {
        return Business::all();
---
select * from `businesses`

    public function getActiveBusinesses()
    {
        return Business::where(["active_status" => "1"])->get();
---
select * from `businesses` where (`active_status` = '1') and `businesses`.`deleted_at` is null