Modules/BusinessService/Repositories/BusinessCustomerRepository.php

insert into `business_customers` (`customer_id`, `business_id`, `id`, `updated_at`, `created_at`) values ('9a2d9cfb-161a-4ff5-8a80-7d410115a74e', '9a2d9ca3-a59b-4af3-ad10-a897943b7758', '9a2d9cfb-1df0-4510-9d11-a37130a3d1f7', '2023-09-20 10:49:39', '2023-09-20 10:49:39')
---
    public function create($customer_id, $business_id)
    {
        // Try to find the business customer with the given customer_id and business_id
        // If it does not exist, then create it
        return BusinessCustomer::firstOrCreate([
            'customer_id' => $customer_id,
            'business_id' => $business_id,
        ]);