Modules/BusinessService/Repositories/CustomerAddressRepository.php

    public function create($data)
    {
        return CustomerAddress::create($data);
---
insert into `customer_addresses` (`address`, `address_type`, `latitude`, `longitude`, `customer_id`, `address_status`, `area_id`, `city_id`, `state_id`, `country_id`, `id`, `updated_at`, `created_at`) values ('bullshit, fuck no, Arabella 3 townhouses', 'OTHER', '', '', '9a2d9cfb-161a-4ff5-8a80-7d410115a74e', 'MANUAL_APPORVAL_REQUIRED', '9a2d7e6b-71ec-4337-a91a-84288e88849a', '32', '3391', '231', '9a2d9cfb-2c7a-452c-8a8a-2ea5960ccd73', '2023-09-20 10:49:39', '2023-09-20 10:49:39')

    public function getCustomerCityAddresses($customer_id, $city_id)
    {
        return CustomerAddress::where('customer_id', $customer_id)
            ->where('city_id', $city_id)
            ->get();
---
select * from `customer_addresses` where `customer_id` = '9a2d603f-148d-4c32-8a7f-6a70946d974e' and `city_id` = '77a716eb-578a-11ee-ba43-548d5ae8bd8f'