Modules/BusinessService/Repositories/CustomerRepository.php

    public function create($data)
    {
        return Customer::create($data);
---
insert into `customers` (`user_id`, `id`, `updated_at`, `created_at`) values ('9a2d9cfb-1307-4cda-9ec3-cacdc79cc878', '9a2d9cfb-161a-4ff5-8a80-7d410115a74e', '2023-09-20 10:49:39', '2023-09-20 10:49:39')

    public function customerWithMatchingPhoneNoInUsers($phone_no)
    {
        return Customer::with('user')->whereHas('user', function ($query) use ($phone_no) {
            $query->where('phone', $phone_no);
        })->first();
---
select * from `customers` where exists (select * from `users` where `customers`.`user_id` = `users`.`id` and `phone` = '971588398194') limit 1

    public function customerWithMatchingEmailInUsers($email)
    {
        return Customer::with('user')->whereHas('user', function ($query) use ($email) {
            $query->where('email', $email);
        })->first();
---
select * from `customers` where exists (select * from `users` where `customers`.`user_id` = `users`.`id` and `email` = 'lukebrown1234@gmail.com') limit 1