Modules/HRManagement/Repositories/BanksRepository.php

insert into `banks` (`bank_name`, `iban`, `account_title`, `account_number`, `swift_code`, `sort_code`, `account_currency`, `status`, `employee_id`, `id`, `updated_at`, `created_at`) values ('', '', '', '', '', '', '', 'active', '9a2da5ce-6eb8-411b-b0e8-c086ee638009', '9a2da5ce-76d7-4ebc-bc21-faab7ff3c1aa', '2023-09-20 11:14:19', '2023-09-20 11:14:19')
---
    public function createBank($bankName, $employeeId, $iban = null, $accountTitle = null, $accountNumber = null, $swiftCode = null, $sortCode = null, $accountCurrency = null)
    {
        $bank =  new Banks([
            "bank_name"=>$bankName,
            "iban"=>$iban,
            "account_title"=>$accountTitle,
            "account_number"=>$accountNumber,
            "swift_code"=>$swiftCode,
            "sort_code"=>$sortCode,
            "account_currency"=>$accountCurrency,
            "status"=>"active",
            "employee_id"=>$employeeId,
        ]);
        return $bank->save();