Modules/HRManagement/Repositories/DepartmentsRepository.php

    public function createDepartment($departmentName, $status = "active")
    {
        $department = new Departments([
            "department_name"=>$departmentName,
            "status"=>$status,
        ]);
        $department->save();
---
insert into `departments` (`department_name`, `status`, `id`, `updated_at`, `created_at`) values ('Drivers', 'active', '9a2da414-9cac-4a79-a94d-6fb01c7ac3aa', '2023-09-20 11:09:30', '2023-09-20 11:09:30')

    public function getDepartments()
    {
        return Departments::all();
---
select * from `departments`