Modules/HRManagement/Repositories/DesignationsRepository.php

insert into `designations` (`name`, `parent_designation_id`, `id`, `updated_at`, `created_at`) values ('Fleet manager', '', '9a2da4ed-900c-4c1c-8bc6-65760708c043', '2023-09-20 11:11:52', '2023-09-20 11:11:52')
---
    public function createDesignation($name, $parentDesignationId = null)
    {
        $designation = new Designations([
            "name" => $name,
            "parent_designation_id" => $parentDesignationId,
        ]);

        return $designation->save();

select * from `designations` where `designations`.`id` = '9a2da533-6d32-4ce1-873a-097ffc73f9d5' limit 1
---
    public function updateDesignation($id, $name = null, $parentDesignationId = null)
    {
        $designation = Designations::find($id);

select * from `designations`
---
    public function getDesignations()
    {
        return Designations::all();

select * from `designations` where `designations`.`id` = '9a2da533-6d32-4ce1-873a-097ffc73f9d5' limit 1
---
    public function getDesignation($id)
    {
        return Designations::find($id);