Modules/HRManagement/Repositories/EmployeeDepartmentsRepository.php

    public function createEmployeeDepartment($employeeId, $departmentId, $isManager = false, $isPrimary = false)
    {
        $employeeDepartment = new EmployeeDepartments([
            "is_manager"=>$isManager,
            "is_primary"=>$isPrimary,
            "employee_id"=>$employeeId,
            "department_id"=>$departmentId,
        ]);

        return $employeeDepartment->save();
---
insert into `employee_departments` (`is_manager`, `is_primary`, `employee_id`, `department_id`, `id`, `updated_at`, `created_at`) values (0, 0, '9a2da5ce-6eb8-411b-b0e8-c086ee638009', '9a2da414-9cac-4a79-a94d-6fb01c7ac3aa', '9a2da5ce-73a7-4b7d-b6de-5050c401e138', '2023-09-20 11:14:19', '2023-09-20 11:14:19')