Modules/HRManagement/Repositories/EmployeesRepository.php

insert into `employees` (`first_name`, `last_name`, `personal_email_address`, `personal_phone_number`, `company_email_address`, `company_phone_number`, `picture`, `city`, `country`, `marital_status`, `hire_date`, `probation_period_start`, `probation_period_end`, `designation_id`, `leave_policy_id`, `employee_type`, `contract_start_date`, `contract_end_date`, `user_id`, `id`, `updated_at`, `created_at`) values ('Ayanna', 'Duke', 'driver@gmail.com', '1234567890', 'wymomony@mailinator.com', '', '', 'Islamabad', 'Pakistan', 'Unmarried', '1990-02-06', '2016-12-20', '1973-04-18', '9a2da533-6d32-4ce1-873a-097ffc73f9d5', '9a2da4d0-b535-48eb-baf6-d03bd71bb9e4', 'Full Time', '', '', '9a2da5ce-6994-48ab-a9ee-4b7c511c0ba6', '9a2da5ce-6eb8-411b-b0e8-c086ee638009', '2023-09-20 11:14:19', '2023-09-20 11:14:19')
---
    public function createEmployee($firstName, $lastName, $personalEmailAddress, $personalPhoneNumber, $companyEmailAddress = null, $companyPhoneNumber = null,
                                   $picture = null, $city = null, $country = null, $maritalStatus = null, $hireDate = null,
                                   $probationStartDate = null, $probationEndDate = null, $designationId = null, $leavePolicyId = null, $employeeType = null, $contractStartDate = null, $contractEndDate = null, $userId = null)
    {
        $employee = new Employees([
            "first_name" => $firstName,
            "last_name" => $lastName,
            "personal_email_address" => $personalEmailAddress,
            "personal_phone_number" => $personalPhoneNumber,
            "company_email_address" => $companyEmailAddress,
            "company_phone_number" => $companyPhoneNumber,
            "picture" => $picture,
            "city" => $city,
            "country" => $country,
            "marital_status" => $maritalStatus,
            "hire_date" => $hireDate,
            "probation_period_start" => $probationStartDate,
            "probation_period_end" => $probationEndDate,
            "designation_id" => $designationId,
            "leave_policy_id" => $leavePolicyId,
            "employee_type" => $employeeType,
            "contract_start_date" => $contractStartDate,
            "contract_end_date" => $contractEndDate,
            "user_id" => $userId
        ]);

        $employee->save();

select * from `designations` where `designations`.`id` in ('9a2da533-6d32-4ce1-873a-097ffc73f9d5')
select * from `employees`
---
    public function getEmployees()
    {
        return Employees::with('designation')->get();