Modules/HRManagement/Repositories/LeavePolicyRepository.php

select * from `leave_policies`
---
    public function getLeavePolicies()
    {
       return LeavePolicy::all();