Modules/HRManagement/Repositories/LeaveTypesRepository.php

    public function createLeaveType($name, $color)
    {
        $leaveType = new LeaveTypes([
            "name"=>$name,
            "color"=>$color
        ]);

        return $leaveType->save();
---
insert into `leave_types` (`name`, `color`, `id`, `updated_at`, `created_at`) values ('monthly', '#000000', '9a2da49f-afd2-4609-b7d6-d5014127e412', '2023-09-20 11:11:01', '2023-09-20 11:11:01')

    public function getLeaveTypes()
    {
        return LeaveTypes::all();
---
select * from `leave_types`