Modules/HRManagement/Repositories/TaxesRepository.php

    public function getTaxes()
    {
        return Taxes::all();
---
select * from `taxes`