Modules/HRManagement/Repositories/TeamsRepository.php

select * from `teams`
---
    public function getTeams()
    {
        return Teams::all();