Modules/HRManagement/Http/Controllers/Employees/EmployeesController.php

insert into `users` (`name`, `email`, `password`, `is_active`, `id`, `updated_at`, `created_at`) values ('Ayanna Duke', 'wymomony@mailinator.com', '$2y$10$Ae8tIXvj0dcZ/hcR68/E/Om3yWrnCixSjL9R6XH4WQAKTN6guaL.O', 1, '9a2da5ce-6994-48ab-a9ee-4b7c511c0ba6', '2023-09-20 11:14:19', '2023-09-20 11:14:19')
select * from `users` where (`email` = 'wymomony@mailinator.com') limit 1
---
                    "password" => Hash::make($password),
                    "is_active" => true,
                ]);
                $user->save();
                $user = User::where(["email" => $company_email_address])->first();