Modules/FleetService/Repositories/DriverRepository.php

    public function createDriver($employee_id,$license_number, $is_available, $license_document, $license_issue_date, $license_expiry_date)
    {

        $driver = Driver::create([
            'license_number' => $license_number,
            'is_available' => $is_available,
            'license_document' => $license_document,
            'license_issue_date' => $license_issue_date,
            'license_expiry_date' => $license_expiry_date,
            'employee_id' => $employee_id,
        ]);
---
insert into `drivers` (`license_number`, `is_available`, `license_document`, `license_issue_date`, `license_expiry_date`, `employee_id`, `id`, `updated_at`, `created_at`) values ('950', '1', '', '2023-09-01', '2024-02-01', '9a2da5ce-6eb8-411b-b0e8-c086ee638009', '9a2da64f-c642-46f4-81ab-ec770755e4e1', '2023-09-20 11:15:44', '2023-09-20 11:15:44')

    public function getDrivers(){
        return Driver::all();
---
select * from `drivers` where `drivers`.`deleted_at` is null