Modules/FleetService/Repositories/DriverAreaRepository.php

    public function createDriverArea($driver_id,$area_id){
        $driverarea = DriverArea::create([
            "driver_id"=>$driver_id,
            "area_id"=> $area_id,
            ]);
---
insert into `driver_areas` (`driver_id`, `area_id`, `id`, `updated_at`, `created_at`) values ('9a2da64f-c642-46f4-81ab-ec770755e4e1', '9a2d7e6b-71ec-4337-a91a-84288e88849a', '9a2da64f-c933-4318-b78e-a5b5fe488038', '2023-09-20 11:15:44', '2023-09-20 11:15:44')