Modules/FleetService/Repositories/VehicleRepository.php

select * from `vehicles` where `vehicles`.`deleted_at` is null
---
 public function getDetailedVehicles(){
   return Vehicle::with('vehicleType', 'vehicleModel')->get();