Modules/FleetService/Repositories/VehicleTypeRepository.php

select * from `vehicle_types` where `active_status` = 1
---
    public function getActiveVehicleTypes()
    {
        return VehicleType::where('active_status', true)->get();