app/Http/Helper/Helper.php

insert into `activity_logs` (`user_id`, `module_name`, `action`, `subject`, `url`, `description`, `ip_address`, `user_agent`, `old_values`, `new_values`, `record_id`, `record_type`, `method`, `id`, `updated_at`, `created_at`) values ('', 'FinanceService', 'Created', 'New Record Created', 'http://127.0.0.1:8000/businessservice/onboarding/add', 'A New Record has been created', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/116.0.0.0 Safari/537.36', '', '\"{\\"balance\\":0,\\"business_id\\":\\"9a2d9ca3-a59b-4af3-ad10-a897943b7758\\",\\"id\\":\\"9a2d9ca3-c220-4365-b8b9-9a2ec7d4860c\\",\\"updated_at\\":\\"2023-09-20 10:48:41\\",\\"created_at\\":\\"2023-09-20 10:48:41\\"}\"', '9a2d9ca3-c220-4365-b8b9-9a2ec7d4860c', 'Modules\FinanceService\Entities\BusinessWallet', 'POST', '9a2d9ca3-c430-41b8-80f8-8054b29a233b', '2023-09-20 10:48:41', '2023-09-20 10:48:41')
---
    public function logActivity($userId, $moduleName, $action, $subject, $url, $description, $ipAddress, $userAgent, $oldValues, $newValues, $recordId, $recordType, $method)
    {
        ActivityLogs::create([
            'user_id' => $userId,
            'module_name' => $moduleName,
            'action' => $action,
            'subject' => $subject,
            'url' => $url,
            'description' => $description,
            'ip_address' => $ipAddress,
            'user_agent' => $userAgent,
            'old_values' => $oldValues,
            'new_values' => $newValues,
            'record_id' => $recordId,
            'record_type' => $recordType,
            'method' => $method,
        ]);

insert into `business_wallets` (`balance`, `business_id`, `id`, `updated_at`, `created_at`) values (0, '9a2d9ca3-a59b-4af3-ad10-a897943b7758', '9a2d9ca3-c220-4365-b8b9-9a2ec7d4860c', '2023-09-20 10:48:41', '2023-09-20 10:48:41')
---
    public function createWallet($business_id){
        BusinessWallet::create([
            'balance'=>0,
            'business_id'=>$business_id,
        ]);