app/Http/Controllers/Admin/LocationManagement/Area/AreaController.php

        }
        $this->cityRepository->update($city_id, ['active_status' => true]);
        $this->stateRepository->update($city->state_id, ['active_status' => true]);
        $this->countryRepository->update($city->state->country_id, ['active_status' => true]);
---
select * from `states` where `states`.`id` = '3391' limit 1