Modules/DeliveryService/Http/Controllers/Deliveries/DeliveryController.php

select * from `states` where `states`.`id` = '3391' limit 1
---
                    $delivery_data['customer_address_id'] = $finalized_address->id; // Update based on condition
                    $this->deliveryRepository->create($delivery_data);
                } elseif ($address_matching['status'] == 'CONFLICT') {
                    $location_info = [
                        'area_id' => $area->id,
                        'city_id' => $city->id,
                        'state_id' => $city->state->id,
                        'country_id' => $city->state->country->id,
                    ];