app/Providers/AppServiceProvider.php

select * from `user_roles` where `user_roles`.`user_id` = '5c76dd5b-57a4-11ee-ba43-548d5ae8bd8f' and `user_roles`.`user_id` is not null
---
    public function boot()
    {

        Paginator::useBootstrap();
        $user = Auth::user();

        $rolesArray = [];
        $user_roles = UserRole::all();