app/Repositories/ApplicationModelRepository.php

    public function getApplicationModels()
    {
        return ApplicationModel::all();
---
select * from `application_models`