app/Repositories/AreaRepository.php

    public function add($data)
    {
        return Area::create($data);
---
insert into `areas` (`name`, `city_id`, `geoname_id`, `coordinates`, `id`, `updated_at`, `created_at`) values ('Dubai Marina', '77a716eb-578a-11ee-ba43-548d5ae8bd8f', '8469788', '25.08525,55.14646', '9a2d5f4a-1b32-4260-8eaf-13e54dc955d6', '2023-09-20 07:57:08', '2023-09-20 07:57:08')

    public function getWhere($where)
    {
        return Area::with('city')->where($where)->get();
---
select * from `cities` where `cities`.`id` in ('32')

    public function getAreasOfCity($city_id)
    {
        return Area::where(["city_id" => $city_id, "active_status" => 1])->get();
---
select * from `areas` where (`city_id` = '32' and `active_status` = 1)

    public function searchArea($searchTerm)
    {
        return Area::where('name', 'like', "%{$searchTerm}%")->get();
---
select * from `areas` where `name` like '%Dubai Marina%' limit 1