app/Repositories/CityRepository.php

select * from `cities` where `cities`.`id` = '32' limit 1
---
    public function get($id)
    {
        return City::find($id);

update `cities` set `active_status` = 1, `cities`.`updated_at` = '2023-09-20 09:24:12' where `id` = '32'
---
    public function update($id, $data)
    {
        return City::where('id', $id)->update($data);

select count(*) as aggregate from `cities`
---
    public function getAllCities()
    {
        return City::paginate(10);

select * from `cities` where (`state_id` = 'b1ef524f-56d9-11ee-a90d-548d5ae8bd8f' and `active_status` = 1)
---
    public function getCitiesOfState($state_id)
    {
        return City::where(["state_id" => $state_id, "active_status" => 1])->get();

select * from `cities` where `name` like '%Dubai%' limit 1
---
    public function searchCity($searchTerm)
    {
        return City::where('name', 'like', "%{$searchTerm}%")->get();