app/Repositories/CountryRepository.php

update `countries` set `active_status` = 1, `countries`.`updated_at` = '2023-09-20 09:24:12' where `id` = '231'
---
    public function update($id, $data)
    {
        return Country::where('id', $id)->update($data);

select * from `countries` where (`active_status` = 1)
---
    public function getAllActiveCountries()
    {
        return Country::where(["active_status" => 1])->get();