app/Repositories/DeliverySlotRepository.php

select * from `delivery_slots`
---
    public function getAllDeliverySlots()
    {
        return DeliverySlot::all();

select * from `delivery_slots` where `start_time` = '08:00' and `end_time` = '11:00' and `city_id` = '32' and `active_status` = 1 limit 1
---
    public function getDeliverySlotsByTimeAndCity($start_time, $end_time, $city_id)
    {
        return DeliverySlot::where('start_time', $start_time)
            ->where('end_time', $end_time)
            ->where('city_id', $city_id)
            ->where('active_status', 1)
            ->first();