app/Repositories/PermissionRepository.php

select * from `permissions`
---
    public function getPermissions()
    {
        return Permission::all();