app/Repositories/StateRepository.php

    public function update($id, $data)
    {
        return State::where('id', $id)->update($data);
---
update `states` set `active_status` = 1, `states`.`updated_at` = '2023-09-20 09:24:12' where `id` = '3391'

    public function getStatesOfCountry($country_id)
    {
        return State::where(["country_id" => $country_id, "active_status" => 1])->get();
---
select * from `states` where (`country_id` = '231' and `active_status` = 1)