app/Repositories/UserRepository.php

insert into `users` (`name`, `email`, `phone`, `password`, `id`, `updated_at`, `created_at`) values ('Zainab Albishari', 'lukebrown1234@gmail.com', '971588398194', '$2y$10$E9mA4ePu0DHJF26CktaVlOk.Sh5mRRKvpZm505guMzBuF1tIx.4mG', '9a2d9cfb-1307-4cda-9ec3-cacdc79cc878', '2023-09-20 10:49:39', '2023-09-20 10:49:39')
---
    public function createUser($name, $email, $password, $isActive = true, $isSuperUser = false)
    {
        $user = new User([
            "name" => $name,
            "email" =>$email,
            "password" => $password,
            "is_active"=>$isActive,
            "is_superuser"=>$isSuperUser
        ]);

        $user->save();