app/Repositories/UserRoleRepository.php

insert into `user_roles` (`user_id`, `role_id`, `id`, `updated_at`, `created_at`) values ('9a2d9ca3-9d2e-4425-bfec-2f5bdd9c00b8', '9959f101-265e-47cd-8d70-2920aa972838', '9a2d9ca5-9f6c-421b-9b11-e54bff64fb62', '2023-09-20 10:48:43', '2023-09-20 10:48:43')
---
    public function createUserRole($userId, $roleId)
    {
        $user_roles = new UserRole([
            "user_id" => $userId,
            "role_id" => $roleId
        ]);
        $user_roles->save();